programming/20221210020053-modbus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-27 Sat 00:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modbus</title>
<meta name="author" content="NSASPY" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Modbus</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge997d05">1. Modbus&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ics">ics</span>&#xa0;<span class="protocol">protocol</span></span></a>
<ul>
<li><a href="#orgbec740c">1.1. Limits</a></li>
<li><a href="#org09bd24d">1.2. Memory area</a></li>
<li><a href="#org4d6f68e">1.3. Modbus RTU Frame Format</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orge997d05" class="outline-2">
<h2 id="orge997d05"><span class="section-number-2">1.</span> Modbus&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ics">ics</span>&#xa0;<span class="protocol">protocol</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
Modbus is a data communication protocol by Modicon in the 1970s. It is designed for use with <a href="../20221210020640-programmable_logic_controllers.html#ID-27a4cf94-829a-4182-9dc8-3dd99da55fe9">programmable logic controllers</a>.
Modbus is the most commonly used standard for connecting industrial devices.
modbus uses Serical lines, ethernet or others as a transport. it is often used to connect a  system supervisory computer with a <a href="../20221210021703-remote_terminal_unit.html#ID-40545110-6180-4f4e-9520-b18b02c78d6e">Remote terminal unit</a>.
</p>
</div>
<div id="outline-container-orgbec740c" class="outline-3">
<h3 id="orgbec740c"><span class="section-number-3">1.1.</span> Limits</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Limited supported data types</li>
<li>No descriptions of data objects</li>
<li>It is a Master Slave model</li>
<li>Limited to 247 devices on one link, except for Ethernet TCP/IP</li>
<li>No protections against malicious commands or sniffing</li>
</ul>
</div>
</div>


<div id="outline-container-org09bd24d" class="outline-3">
<h3 id="org09bd24d"><span class="section-number-3">1.2.</span> Memory area</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This table shows the layout of a typical modbus object
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-right">Size (bits)</th>
<th scope="col" class="org-left">Range</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Coils</td>
<td class="org-left">Discrete Outputs (R+W)</td>
<td class="org-right">1</td>
<td class="org-left">00001 – 09999</td>
</tr>

<tr>
<td class="org-left">Inputs</td>
<td class="org-left">Discrete inputs (R)</td>
<td class="org-right">1</td>
<td class="org-left">10001 – 19999</td>
</tr>

<tr>
<td class="org-left">Input Registers</td>
<td class="org-left">Analog Inputs (R)</td>
<td class="org-right">16</td>
<td class="org-left">30001 – 39999</td>
</tr>

<tr>
<td class="org-left">Holding Registers</td>
<td class="org-left">Analog outputs (R+W)</td>
<td class="org-right">16</td>
<td class="org-left">40001 – 49999</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4d6f68e" class="outline-3">
<h3 id="org4d6f68e"><span class="section-number-3">1.3.</span> Modbus RTU Frame Format</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Length (Bits)</th>
<th scope="col" class="org-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Start</td>
<td class="org-left">3.5 x 8</td>
<td class="org-left">s.5 char times (28 bits) of silence (mark condition)</td>
</tr>

<tr>
<td class="org-left">Address</td>
<td class="org-left">8</td>
<td class="org-left">Station address</td>
</tr>

<tr>
<td class="org-left">Function</td>
<td class="org-left">8</td>
<td class="org-left">Function code (IE read coils)</td>
</tr>

<tr>
<td class="org-left">Data</td>
<td class="org-left">n x 8</td>
<td class="org-left">Data + length will be filled depending on message type</td>
</tr>

<tr>
<td class="org-left">CRC</td>
<td class="org-left">16</td>
<td class="org-left"><a href="../20221210025435-cyclic_redundancy_check.html#ID-2dacee3a-6036-4871-b1c6-462e4785c223">Cyclic redundancy check</a></td>
</tr>

<tr>
<td class="org-left">END</td>
<td class="org-left">3.5 x 8</td>
<td class="org-left">At least 3.5 char times (28 bits) of silence (mark condition) bewteen frames</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: NSASPY</p>
<p class="date">Created: 2023-05-27 Sat 00:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
